In [2]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({
    "employee_id": ['1','2','3','4'],
    "name":["John","Mary","David","Sarah"]
})


df2 = pd.DataFrame({
    "employee_id": ['2','3','4','5'],
    "department":["HR","Finance","IT","Marketing"]
})

In [4]:
df1

  employee_id   name
0           1   John
1           2   Mary
2           3  David
3           4  Sarah

In [5]:
df2

  employee_id department
0           2         HR
1           3    Finance
2           4         IT
3           5  Marketing

In [6]:
result  = pd.merge(df1, df2, on="employee_id", how="inner")

In [7]:
result

  employee_id   name department
0           2   Mary         HR
1           3  David    Finance
2           4  Sarah         IT

In [8]:
result  = pd.merge(df1, df2, on="employee_id", how="left")

In [9]:
result

  employee_id   name department
0           1   John        NaN
1           2   Mary         HR
2           3  David    Finance
3           4  Sarah         IT

In [10]:
result  = pd.merge(df1, df2, on="employee_id", how="right")

In [11]:
result

  employee_id   name department
0           2   Mary         HR
1           3  David    Finance
2           4  Sarah         IT
3           5    NaN  Marketing

In [12]:
result  = pd.merge(df1, df2, on="employee_id", how="outer")

In [13]:
result

  employee_id   name department
0           1   John        NaN
1           2   Mary         HR
2           3  David    Finance
3           4  Sarah         IT
4           5    NaN  Marketing

In [15]:
movies = pd.read_csv("https://gist.githubusercontent.com/tiangechen/b68782efa49a16edaf07dc2cdaa855ea/raw/0c794a9717f18b094eabab2cd6a6b9a226903577/movies.csv")

In [17]:
movies.head()

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008